package com.company;

public class Main {

    /*

    Шаги для выполнения задания:

1. Создание проекта
2. В терминале : git init
3. Создание в основной папке проекта файла без имени с расширением .gitignore
4. в файле .gitignore прописываем : *.sass
                                    /bin
                                    /admin
                                    /config
5. В терминале : git add .
6. В терминале : git commit -m "message"
7. В терминале : git branch newbranch
8. В терминале : git checkout newbranch
9. Cоздание папки blog с файлами: index.js, index.html
10. В терминале : git remote add origin https://...
11. В терминале : git push -u origin master

     */
}

/*

    Создайте новый проект и подключите в него Git через терминал.
    Укажите, что в вашем проекте будут игнорироваться все файлы с расширением .sass и папки: bin, admin, config.

        Выполните следующее:

        добавьте все файлы в локальное хранилище;
        создайте новую ветку и перейдите в неё;
        в новой ветке создайте папку blog с файлами: index.js, index.html;
        загрузите на удаленный репозиторий лишь основную ветку вашего проекта.

        Для отправки на проверку создайте файл, в котором пропишите все команды что необходимо было бы сделать для выполнения действий задания.
*/
